ms-iot/lightning/source/CY8C9540ASupport.cpp
// Copyright (c) Microsoft Open Technologies, Inc.  All rights reserved.  
// Licensed under the BSD 2-Clause License.  
// See License.txt in the project root for license information.

#include "CY8C9540ASupport.h"
#include "ExpanderDefs.h"
#include "I2cController.h"


const ULONG CY8C9540ADevice::PWM_BITS          =    8;  // This PWM chip has 8 bits of resolution.
const ULONG CY8C9540ADevice::PWM_CHAN_COUNT    =    8;  // This chip has 8 PWM channels.
const ULONG CY8C9540ADevice::PORT_COUNT        =    6;  // Number of ports supported by this chip.

const ULONG CY8C9540ADevice::IN_BASE_ADR       = 0x00;  // Base address of Input Port registers.
const ULONG CY8C9540ADevice::OUT_BASE_ADR      = 0x08;  // Base address of Output Port registers.
const ULONG CY8C9540ADevice::INT_STAT_BASE_ADR = 0x10;  // Base address of Inerrupt Status registers.
const ULONG CY8C9540ADevice::PORT_SELECT_ADR   = 0x18;  // Address of Port Select register.
const ULONG CY8C9540ADevice::INT_MASK_ADR      = 0x19;  // Address of Interrupt Mask register.
const ULONG CY8C9540ADevice::SEL_PWM_ADR       = 0x1A;  // Address of Select PWM for Port Output register.
const ULONG CY8C9540ADevice::INVERSION_ADR     = 0x1B;  // Address of Inversion register.
const ULONG CY8C9540ADevice::PIN_DIR_ADR       = 0x1C;  // Address of Pin Direction register (0: Out, 1: In)
const ULONG CY8C9540ADevice::PULL_UP_ADR       = 0x1D;  // Address of Drive Mode - Pull Up register.
const ULONG CY8C9540ADevice::PULL_DOWN_ADR     = 0x1E;  // Address of Drive Mode - Pull Down register.
const ULONG CY8C9540ADevice::OPEN_HIGH_ADR     = 0x1F;  // Address of Drive Mode - Open Drain High register.
const ULONG CY8C9540ADevice::OPEN_LOW_ADR      = 0x20;  // Address of Drive Mode - Open Drain Low register.
const ULONG CY8C9540ADevice::DRIVE_STRONG_ADR  = 0x21;  // Address of Drive Mode - Strong register.
const ULONG CY8C9540ADevice::SLOW_STRONG_ADR   = 0x22;  // Address of Drive Mode - Slow Strong register.
const ULONG CY8C9540ADevice::HIGH_Z_ADR        = 0x23;  // Address of Drive Mode - High-Z register.
const ULONG CY8C9540ADevice::PWM_SELECT_ADR    = 0x28;  // Address of PWM Select register.
const ULONG CY8C9540ADevice::CONFIG_PWM_ADR    = 0x29;  // Address of Config PWM register.
const ULONG CY8C9540ADevice::PERIOD_PWM_ADR    = 0x2A;  // Address of Period PWM register.
const ULONG CY8C9540ADevice::PULSE_WIDTH_ADR   = 0x2B;  // Address of Pulse Width PWM register.
const ULONG CY8C9540ADevice::DIVIDER_ADR       = 0x2C;  // Address of Programmable Diver register.
const ULONG CY8C9540ADevice::ENABLE_EEE_ADR    = 0x2D;  // Address of Enable WDE, EEE, EERO register.
const ULONG CY8C9540ADevice::ID_STATUS_ADR     = 0x2E;  // Address of Device ID/Status register.
const ULONG CY8C9540ADevice::WATCHDOG_ADR      = 0x2F;  // Address of Watchdog register.
const ULONG CY8C9540ADevice::COMMAND_ADR       = 0x30;  // Address of Command register.

const ULONG CY8C9540ADevice::PWM_CLK_32K       = 0x00;  // Config PWM register value for 32 kHz clock.
const ULONG CY8C9540ADevice::PWM_CLK_24M       = 0x01;  // Config PWM register value for 24 MHz clock.
const ULONG CY8C9540ADevice::PWM_CLK_1M5       = 0x02;  // Config PWM register value for 1.5 MHz clock.
const ULONG CY8C9540ADevice::PWM_CLK_94K       = 0x03;  // Config PWM register value for 93.75 kHz clock.
const ULONG CY8C9540ADevice::PWM_CLK_368       = 0x04;  // Config PWM register value for 367.6 Hz clock.
const ULONG CY8C9540ADevice::PWM_CLK_PREV      = 0x05;  // Config PWM register value for Previous PWM clock.

const ULONG CY8C9540ADevice::CMD_STORE_CONFIG  =    1;  // Command to store device config in EEPROM.
const ULONG CY8C9540ADevice::CMD_FACTORY_DFLTS =    2;  // Command to restore factory defaults.
const ULONG CY8C9540ADevice::CMD_WR_EE_DFLTS   =    3;  // Command to write EEPROM POR defaults.
const ULONG CY8C9540ADevice::CMD_RD_EE_DFLTS   =    4;  // Command to read EEPROM POR defaults.
const ULONG CY8C9540ADevice::CMD_WR_CONFIG     =    5;  // Command to write device configuration.
const ULONG CY8C9540ADevice::CMD_RD_CONFIG     =    6;  // Command to read device configuation.
const ULONG CY8C9540ADevice::CMD_LD_DEFAULTS   =    7;  // Command to reconfigure with stored POR defaults.

/**
This method takes the actions needed to set a port bit of the I/O Expander chip to the desired state.
\param[in] i2cAdr The I2C address of the chip.
\param[in] portBit The number of the port bit to modify.
\param[in] state The state to set the port bit to: HIGH or LOW.
\return TRUE success. FALSE failure, GetLastError() provides error code.
*/
HRESULT CY8C9540ADevice::SetBitState(ULONG i2cAdr, ULONG portBit, ULONG state)
{
    HRESULT hr = S_OK;
    DWORD error = ERROR_SUCCESS;
    I2cTransactionClass transaction;
    ULONG port;                             // Number of the port we are modifying
    ULONG bit;                              // Number of the bit to modify within the port
    UCHAR portRegAdr[1] = { 0 };            // Buffer for port output register address
    UCHAR dataBuf[1] = { 0 };               // Buffer for port data


    // Calculate the number of the port and the bit we are modifying.
    port = portBit >> 3;
    bit = portBit & 0x07;

    if (port >= PORT_COUNT)
    {
        hr = FALSE;
        error = ERROR_INVALID_ADDRESS;
    }

    if (SUCCEEDED(hr) && (state != HIGH) && (state != LOW))
    {
        hr = FALSE;
        error = ERROR_INVALID_STATE;
    }

    // Calculate the address of the output register for the port in question.
    if (SUCCEEDED(hr))
    {
        portRegAdr[0] = (UCHAR) (OUT_BASE_ADR + port);
    }

    //
    // Read what has been sent to the output port.
    //

    if (SUCCEEDED(hr))
    {
        // Set the I2C address of the I/O Expander we want to talk to.
        hr = transaction.setAddress(i2cAdr);
        
    }

    if (SUCCEEDED(hr))
    {
        // Send the address of the output port to the I/O Expander chip.
        hr = transaction.queueWrite(portRegAdr, 1);
        
