ms-iot/lightning/source/CY8C9540ASupport.cpp
    }

    if (SUCCEEDED(hr))
    {
        // Read the port contents from the I/O Expander chip.
        hr = transaction.queueRead(dataBuf, sizeof(dataBuf));
        
    }

    if (SUCCEEDED(hr))
    {
        // Register a callback to set the desired bit state.
        hr = transaction.queueCallback([&dataBuf, bit, state]()
        {
            dataBuf[0] = dataBuf[0] & (~(1 << bit));
            dataBuf[0] = dataBuf[0] | ((state & 0x01) << bit);
            return TRUE;
        }
        );
    }

    if (SUCCEEDED(hr))
    {
        // Send the address of the output port to the I/O Expander chip.
        hr = transaction.queueWrite(portRegAdr, 1, TRUE);
        
    }

    if (SUCCEEDED(hr))
    {
        // Send the desired state of the port bit to the I/O Expander chip.
        hr = transaction.queueWrite(dataBuf, sizeof(dataBuf));
        
    }

    if (SUCCEEDED(hr))
    {
        // Actually perform the I2C transfers specified above.
        hr = transaction.execute();
        
    }

    
    return hr;
}

/**
\param[in] i2cAdr The I2C address of the PWM chip.
\param[in] portBit The number of the port bit to read.
\param[out] state The state of the port bit: HIGH or LOW.
\return TRUE success. FALSE failure, GetLastError() provides error code.
*/
HRESULT CY8C9540ADevice::GetBitState(ULONG i2cAdr, ULONG portBit, ULONG & state)
{
    HRESULT hr = S_OK;
    DWORD error = ERROR_SUCCESS;
    I2cTransactionClass transaction;
    ULONG port;                             // Number of the port we are reading
    ULONG bit;                              // Number of the bit to read on the port
    UCHAR portRegAdr[1] = { 0 };            // Buffer for port input register address
    UCHAR dataBuf[1] = { 0 };               // Buffer for port data


    // Calculate the number of the port and the bit we are reading.
    port = portBit >> 3;
    bit = portBit & 0x07;

    if (port >= PORT_COUNT)
    {
        hr = FALSE;
        error = ERROR_INVALID_ADDRESS;
    }

    // Calculate the address of the input register for the port in question.
    if (SUCCEEDED(hr))
    {
        portRegAdr[0] = (UCHAR)(IN_BASE_ADR + port);
    }

    //
    // Read the input port.
    //

    if (SUCCEEDED(hr))
    {
        // Set the I2C address of the I/O Expander we want to talk to.
        hr = transaction.setAddress(i2cAdr);
        
    }

    if (SUCCEEDED(hr))
    {
        // Send the address of the input port to the I/O Expander chip.
        hr = transaction.queueWrite(portRegAdr, 1);
        
    }

    if (SUCCEEDED(hr))
    {
        // Read the port contents from the I/O Expander chip.
        hr = transaction.queueRead(dataBuf, sizeof(dataBuf));
        
    }

    if (SUCCEEDED(hr))
    {
        // Perform the I2C transfers specified above.
        hr = transaction.execute();
        
    }

    if (SUCCEEDED(hr))
    {
        // Extract the bit we want from the input port data.
        state = (dataBuf[0] >> bit) & 0x01;
    }

    
    return hr;
}

/**
This method sets the direction and drive characterics of a port bit of the I/O Expander.
\param[in] i2cAdr The I2C address of the chip.
\param[in] portBit The number of the port bit to modify.
\param[in] direction The direction to configure for the pin (DIRECTION_IN or DIRECTION_OUT).
\param[in] pullup TRUE - enable the pullup resistor on the pin, FALSE - disable pullup.
\return TRUE success. FALSE failure, GetLastError() provides error code.
*/
HRESULT CY8C9540ADevice::SetBitDirection(ULONG i2cAdr, ULONG portBit, ULONG direction, BOOL pullup)
{
    HRESULT hr = S_OK;
    DWORD error = ERROR_SUCCESS;
    I2cTransactionClass transaction;
    ULONG port;                                     // Number of the port we are modifying
    ULONG bit;                                      // Number of the bit to modify within the port
    UCHAR portSelectAdr[1] = { PORT_SELECT_ADR };   // Address of Port Select register
    UCHAR portSelectData[1] = { 0 };                // Data buffer for writing to Port Select register
    UCHAR directionAdr[1] = { PIN_DIR_ADR };        // Address of Pin Direction register
    UCHAR directionData[1] = { 0 };                 // Data buffer for read/modify/write of Pin Direction
    UCHAR driveAdr[1] = { 0 };                      // Pin drive register address
    UCHAR driveData[1] = { 0 };                     // Data buffer for pin drive read/modify/write operation
    UCHAR outAdr[1] = { 0 };                        // Pin output state register address
    UCHAR outData[1] = { 0 };                       // Data buffer for pin state read/modify/write operation
    UCHAR state;                                    // Variable for bit state


    // Calculate the number of the port and the bit we are modifying.
    port = portBit >> 3;
    bit = portBit & 0x07;

    if (port >= PORT_COUNT)
    {
        hr = FALSE;
        error = ERROR_INVALID_ADDRESS;
    }

    if (SUCCEEDED(hr))
    {
        // Set the I2C address of the I/O Expander we want to talk to.
        hr = transaction.setAddress(i2cAdr);
        
    }

    //
    // Select the port the pin configuration registers refer to.
    //

    if (SUCCEEDED(hr))
    {
        // Queue a write of the port select register address.
        hr = transaction.queueWrite(portSelectAdr, sizeof(portSelectAdr));
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write of the port select data.
        portSelectData[0] = (UCHAR) port;
        hr = transaction.queueWrite(portSelectData, sizeof(portSelectData));
        
    }

    //
    // Set the desired direction for the bit in question.
    //

    if (SUCCEEDED(hr))
    {
        // Queue a write of the port direction register address.
        hr = transaction.queueWrite(directionAdr, sizeof(directionAdr), TRUE);
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a read of the direction register.
        hr = transaction.queueRead(directionData, sizeof(directionData));
        
    }

    if (SUCCEEDED(hr))
    {
        // Determine the desired state of the pin direction bit.
        state = 1;
        if ((direction == DIRECTION_OUT) || pullup)
        {
            state = 0;
        }

