ms-iot/lightning/source/CY8C9540ASupport.cpp
        // Register a callback to set the desired direction for the port bit in question.
        hr = transaction.queueCallback([&directionData, bit, state]()
        {
            directionData[0] = directionData[0] & (~(1 << bit));
            directionData[0] = directionData[0] | ((state & 0x01) << bit);
            return TRUE;
        }
        );
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write of the address of the Direction register to the I/O Expander chip.
        hr = transaction.queueWrite(directionAdr, sizeof(directionAdr), TRUE);
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write to send the modified value back to the direction register.
        hr = transaction.queueWrite(directionData, sizeof(directionData));
        
    }

    //
    // Select the drive type.
    //
    
    if (SUCCEEDED(hr))
    {
        // Determine what drive type is needed.
        if (direction == DIRECTION_OUT)
        {
            driveAdr[0] = DRIVE_STRONG_ADR;
        }
        else if (pullup)
        {
            driveAdr[0] = PULL_UP_ADR;
        }
        else
        {
            driveAdr[0] = HIGH_Z_ADR;
        }

        // Queue a write of the pin drive register address.
        hr = transaction.queueWrite(driveAdr, sizeof(driveAdr), TRUE);
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a read of the drive register.
        hr = transaction.queueRead(driveData, sizeof(driveData));
        
    }

    if (SUCCEEDED(hr))
    {
        // Register a callback to set the appropriate bit in the drive register data.
        hr = transaction.queueCallback([&driveData, bit]()
        {
            driveData[0] = driveData[0] | (0x01U << bit);
            return TRUE;
        }
        );
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write of pin drive register address.
        hr = transaction.queueWrite(driveAdr, sizeof(driveAdr), TRUE);
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write to send the modified data back to the port drive register.
        hr = transaction.queueWrite(driveData, sizeof(driveData));
        
    }

    //
    // If the pin is an input with a pull-up, set the pin on the output port high.
    //

    if (SUCCEEDED(hr) && (direction != DIRECTION_OUT) && pullup)
    {
        // Queue a write of the port output register address.
        outAdr[0] = (UCHAR)(OUT_BASE_ADR + port);
        hr = transaction.queueWrite(outAdr, sizeof(outAdr), TRUE);
        

        if (SUCCEEDED(hr))
        {
            // Queue a read of the port output register.
            hr = transaction.queueRead(outData, sizeof(outData));
            
        }

        if (SUCCEEDED(hr))
        {
            // Register a callback to set the appropriate bit in the drive register data.
            hr = transaction.queueCallback([&outData, bit]()
            {
                outData[0] = outData[0] | (0x01U << bit);
                return TRUE;
            }
            );
        }

        if (SUCCEEDED(hr))
        {
            // Queue a write of port output register address.
            hr = transaction.queueWrite(outAdr, sizeof(outAdr), TRUE);
            
        }

        if (SUCCEEDED(hr))
        {
            // Queue a write to send the modified data back to the port drive register.
            hr = transaction.queueWrite(outData, sizeof(outData));
            
        }
    }

    //
    //  Perform all the I2C transfers specified above.
    //
    if (SUCCEEDED(hr))
    {
        hr = transaction.execute();
        
    }

    
    return hr;
}

// This is a placeholder in case this function is needed in the future.
HRESULT CY8C9540ADevice::GetBitDirection(ULONG i2cAdr, ULONG portBit, ULONG & direction)
{
    HRESULT hr = S_OK;
    DWORD error = ERROR_SUCCESS;

    
    return hr;
}

/**
\param[in] i2cAdr The I2C address of the PWM chip.
\param[in] portBit The number of the port bit to configure as a PWM output.
\param[in] pwmChan The PWM channel associated with the port bit.
\return TRUE success. FALSE failure, GetLastError() provides error code.
*/
HRESULT CY8C9540ADevice::SetPortbitPwm(ULONG i2cAdr, ULONG portBit, ULONG pwmChan)
{
    HRESULT hr = S_OK;
    DWORD error = ERROR_SUCCESS;
    I2cTransactionClass transaction;
    ULONG port;                                     // Number of the port we are modifying
    ULONG bit;                                      // Number of the bit to modify within the port
    UCHAR portSelectAdr[1] = { PORT_SELECT_ADR };   // Address of Port Select register
    UCHAR portSelectData[1] = { 0 };                // Data buffer for writing to Port Select register
    UCHAR selectPwmAdr[1] = { SEL_PWM_ADR };        // Address of Select PWM register
    UCHAR selectPwmData[1] = { 0 };                 // Data buffer for writing Select PWM register


    // Calculate the number of the port and the bit we are dealing with.
    port = portBit >> 3;
    bit = portBit & 0x07;

    if (port >= PORT_COUNT)
    {
        hr = FALSE;
        error = ERROR_INVALID_ADDRESS;
    }

    if (SUCCEEDED(hr))
    {
        // Set the I2C address of the I/O Expander we want to talk to.
        hr = transaction.setAddress(i2cAdr);
        
    }

    if (SUCCEEDED(hr))
    {
        // Set the expander bit to be an output with strong drive.
        hr = SetBitDirection(i2cAdr, portBit, DIRECTION_OUT, FALSE);
        
    }

    // Select PWM to output on the pin.
    if (SUCCEEDED(hr))
    {
        // Queue a write of the port select register address.
        hr = transaction.queueWrite(portSelectAdr, sizeof(portSelectAdr));
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write of the port select data.
        portSelectData[0] = (UCHAR)port;
        hr = transaction.queueWrite(portSelectData, sizeof(portSelectData));
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write of the Select PWM register address.
        hr = transaction.queueWrite(selectPwmAdr, sizeof(selectPwmAdr), TRUE);
        
