ms-iot/lightning/source/CY8C9540ASupport.cpp
    }

    if (SUCCEEDED(hr))
    {
        // Queue a read of the Select PWM register.
        hr = transaction.queueRead(selectPwmData, sizeof(selectPwmData));
        
    }

    if (SUCCEEDED(hr))
    {
        // Register a callback to set the Select PWM bit for the correct port bit.
        hr = transaction.queueCallback([&selectPwmData, bit]()
        {
            selectPwmData[0] = selectPwmData[0] | (0x01 << bit);
            return TRUE;
        }
        );
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write of the Select PWM register address.
        hr = transaction.queueWrite(selectPwmAdr, sizeof(selectPwmAdr), TRUE);
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write to send the modified value back to the Select PWM register.
        hr = transaction.queueWrite(selectPwmData, sizeof(selectPwmData));
        
    }

    if (SUCCEEDED(hr))
    {
        //  Perform the I2C transfers specified above.
        hr = transaction.execute();
        
    }

    if (SUCCEEDED(hr))
    {
        // Set the expander port bit high.
        hr = SetBitState(i2cAdr, portBit, 1);
        
    }

    if (SUCCEEDED(hr))
    {
        // Set the PWM frequency.
        hr = _configurePwmChannelFrequency(i2cAdr, pwmChan);
        
    }

    
    return hr;
}

/**
\param[in] i2cAdr The I2C address of the PWM chip.
\param[in] portBit The number of the port bit to configure for Digital I/O.
\return TRUE success. FALSE failure, GetLastError() provides error code.
*/
HRESULT CY8C9540ADevice::SetPortbitDio(ULONG i2cAdr, ULONG portBit)
{
    HRESULT hr = S_OK;
    DWORD error = ERROR_SUCCESS;
    I2cTransactionClass transaction;
    ULONG port;                                     // Number of the port we are modifying
    ULONG bit;                                      // Number of the bit to modify within the port
    UCHAR portSelectAdr[1] = { PORT_SELECT_ADR };   // Address of Port Select register
    UCHAR portSelectData[1] = { 0 };                // Data buffer for writing to Port Select register
    UCHAR selectPwmAdr[1] = { SEL_PWM_ADR };        // Address of Select PWM register
    UCHAR selectPwmData[1] = { 0 };                 // Data buffer for writing Select PWM register


    // Calculate the number of the port and the bit we are dealing with.
    port = portBit >> 3;
    bit = portBit & 0x07;

    if (port >= PORT_COUNT)
    {
        hr = FALSE;
        error = ERROR_INVALID_ADDRESS;
    }

    if (SUCCEEDED(hr))
    {
        // Set the I2C address of the I/O Expander we want to talk to.
        hr = transaction.setAddress(i2cAdr);
        
    }

    // De-select PWM for the pin.
    if (SUCCEEDED(hr))
    {
        // Queue a write of the port select register address.
        hr = transaction.queueWrite(portSelectAdr, sizeof(portSelectAdr));
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write of the port select data.
        portSelectData[0] = (UCHAR)port;
        hr = transaction.queueWrite(portSelectData, sizeof(portSelectData));
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write of the Select PWM register address.
        hr = transaction.queueWrite(selectPwmAdr, sizeof(selectPwmAdr), TRUE);
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a read of the Select PWM register.
        hr = transaction.queueRead(selectPwmData, sizeof(selectPwmData));
        
    }

    if (SUCCEEDED(hr))
    {
        // Register a callback to clear the Select PWM bit for the correct port bit.
        hr = transaction.queueCallback([&selectPwmData, bit]()
        {
            selectPwmData[0] = selectPwmData[0] & ~(0x01 << bit);
            return TRUE;
        }
        );
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write of the Select PWM register address.
        hr = transaction.queueWrite(selectPwmAdr, sizeof(selectPwmAdr), TRUE);
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write to send the modified value back to the Select PWM register.
        hr = transaction.queueWrite(selectPwmData, sizeof(selectPwmData));
        
    }

    if (SUCCEEDED(hr))
    {
        //  Perform the I2C transfers specified above.
        hr = transaction.execute();
        
    }

    
    return hr;
}

/**
Set the width of the positive pulses on one of the PWM channels.
\param[in] i2cAdr The I2C address of the PWM chip.
\param[in] channel The channel on the PWM chip for which to set the pulse width.
\param[in] dutyCycle The desired duty-cycle of the positive pulses (0-0xFFFFFFFF for 0-100%).
\return TRUE success.FALSE failure, GetLastError() provides error code.
*/
HRESULT CY8C9540ADevice::SetPwmDutyCycle(ULONG i2cAdr, ULONG channel, ULONG dutyCycle)
{
    HRESULT hr = S_OK;
    DWORD error = ERROR_SUCCESS;
    I2cTransactionClass transaction;
    ULONGLONG pulseWidth = 0;
    UCHAR chanSelectAdr[1] = { PWM_SELECT_ADR };    // Address of PWM Channel Select register
    UCHAR chanSelectData[1] = { 0 };                // Data buffer for writing to Channel Select register
    UCHAR pulseWidthAdr[1] = { PULSE_WIDTH_ADR };   // Address of PWM Pulsewidth register
    UCHAR pulseWidthData[1] = { 0 };                // Data buffer for writing Select PWM register


    if (channel >= PWM_CHAN_COUNT)
    {
        hr = FALSE;
        error = ERROR_INVALID_ADDRESS;
    }

    if (SUCCEEDED(hr))
    {
        // Calculate the pulse width value for the specified dutyCycle.
        pulseWidth = ((dutyCycle * ((ULONGLONG)((1<<PWM_BITS)-1))) + 0x7FFFFFFFULL) / 0xFFFFFFFFULL;
        pulseWidthData[0] = (UCHAR)pulseWidth;
    }

    if (SUCCEEDED(hr))
    {
        // Set the I2C address of the I/O Expander we want to talk to.
        hr = transaction.setAddress(i2cAdr);
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write of the PWM Select register address.
        hr = transaction.queueWrite(chanSelectAdr, sizeof(chanSelectAdr));
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write of the PWM channel number data.
        chanSelectData[0] = (UCHAR)channel;
        hr = transaction.queueWrite(chanSelectData, sizeof(chanSelectData));
        
