ms-iot/lightning/source/CY8C9540ASupport.cpp
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write of the PWM Period register address.
        hr = transaction.queueWrite(pulseWidthAdr, sizeof(pulseWidthAdr), TRUE);
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write of the PWM Period data.
        hr = transaction.queueWrite(pulseWidthData, sizeof(pulseWidthData));
        
    }

    if (SUCCEEDED(hr))
    {
        //  Perform the I2C transfers specified above.
        hr = transaction.execute();
        
    }

    
    return hr;
}

/**
This method gets the desired frequency from the array of frequencies by channel
number.  The only frequency currently supported i 367 hz.
\param[in] i2cAdr The I2C address of the PWM chip.
\param[in] channel The channel on the PWM chip for which to set the frequencey.
\return TRUE success.FALSE failure, GetLastError() provides error code.
*/
HRESULT CY8C9540ADevice::_configurePwmChannelFrequency(ULONG i2cAdr, ULONG channel)
{
    HRESULT hr = S_OK;
    DWORD error = ERROR_SUCCESS;
    I2cTransactionClass transaction;
    ULONGLONG pulseWidth = 0;
    UCHAR pwmRegBaseAdr[1] = { PWM_SELECT_ADR };    // Address of PWM Channel Select register
    UCHAR pwmRegData[3] = { 0, PWM_CLK_94K, 0xFF }; // Data buffer for writing to PWM registers


    if (channel >= PWM_CHAN_COUNT)
    {
        hr = FALSE;
        error = ERROR_INVALID_ADDRESS;
    }

    if (SUCCEEDED(hr))
    {
        // Put channel number in PWM reg data so it will land in the PWM Select register.
        pwmRegData[0] = (UCHAR)channel;

        // Set the I2C address of the I/O Expander we want to talk to.
        hr = transaction.setAddress(i2cAdr);
        
    }

    if (SUCCEEDED(hr))
    {
        // Queue a write of the PWM register data.
        hr = transaction.queueWrite(pwmRegData, sizeof(pwmRegData));
        
    }

    if (SUCCEEDED(hr))
    {
        //  Perform the I2C transfer specified above.
        hr = transaction.execute();
        
    }

    
    return hr;
}



